results/reports/nginx-20260605-105912/default_noisy_wrk.txt
Running 10s test @ http://127.0.0.1:18080/
  2 threads and 32 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     0.97ms  451.38us  22.16ms   83.42%
    Req/Sec    16.71k     3.72k   26.43k    62.00%
  Latency Distribution
     50%  840.00us
     75%    1.25ms
     90%    1.46ms
     99%    2.06ms
  332400 requests in 10.00s, 55.47MB read
Requests/sec:  33234.93
Transfer/sec:      5.55MB